glennlopez/EmbeddedSystems.Playground/Texas Instruments/TM4C123G/Projects/GPIO_4C123/Debug/tm4c123gh6pm_startup_ccs.asm
;******************************************************************************
;* TI ARM C/C++ Codegen                                        PC v16.9.0.LTS *
;* Date/Time created: Fri Mar 10 00:22:01 2017                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embedded_constants=on --endian=little --float_support=FPv4SPD16 --hll_source=on --object_format=elf --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.0.LTS Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("D:\Github Clones\EmbeddedSystems.Playground\Texas Instruments\TM4C123G\Projects\GPIO_4C123\Debug")
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("__STACK_TOP")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("__STACK_TOP")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$1, DW_AT_decl_line(0x39)
	.dwattr $C$DW$1, DW_AT_decl_column(0x11)

	.global	g_pfnVectors
	.sect	".intvecs"
	.align	4
	.elfsym	g_pfnVectors,SYM_SIZE(620)
g_pfnVectors:
	.bits	__STACK_TOP,32		; g_pfnVectors[0] @ 0
	.bits	ResetISR,32		; g_pfnVectors[1] @ 32
	.bits	NmiSR,32		; g_pfnVectors[2] @ 64
	.bits	FaultISR,32		; g_pfnVectors[3] @ 96
	.bits	IntDefaultHandler,32		; g_pfnVectors[4] @ 128
	.bits	IntDefaultHandler,32		; g_pfnVectors[5] @ 160
	.bits	IntDefaultHandler,32		; g_pfnVectors[6] @ 192
	.bits	0,32			; g_pfnVectors[7] @ 224
	.bits	0,32			; g_pfnVectors[8] @ 256
	.bits	0,32			; g_pfnVectors[9] @ 288
	.bits	0,32			; g_pfnVectors[10] @ 320
	.bits	SVC_Handler,32		; g_pfnVectors[11] @ 352
	.bits	DebugMon_Handler,32		; g_pfnVectors[12] @ 384
	.bits	0,32			; g_pfnVectors[13] @ 416
	.bits	PendSV_Handler,32		; g_pfnVectors[14] @ 448
	.bits	SysTick_Handler,32		; g_pfnVectors[15] @ 480
	.bits	GPIOPortA_Handler,32		; g_pfnVectors[16] @ 512
	.bits	GPIOPortB_Handler,32		; g_pfnVectors[17] @ 544
	.bits	GPIOPortC_Handler,32		; g_pfnVectors[18] @ 576
	.bits	GPIOPortD_Handler,32		; g_pfnVectors[19] @ 608
	.bits	GPIOPortE_Handler,32		; g_pfnVectors[20] @ 640
	.bits	UART0_Handler,32		; g_pfnVectors[21] @ 672
	.bits	UART1_Handler,32		; g_pfnVectors[22] @ 704
	.bits	SSI0_Handler,32		; g_pfnVectors[23] @ 736
	.bits	I2C0_Handler,32		; g_pfnVectors[24] @ 768
	.bits	PWM0Fault_Handler,32		; g_pfnVectors[25] @ 800
	.bits	PWM0Generator0_Handler,32		; g_pfnVectors[26] @ 832
	.bits	PWM0Generator1_Handler,32		; g_pfnVectors[27] @ 864
	.bits	PWM0Generator2_Handler,32		; g_pfnVectors[28] @ 896
	.bits	Quadrature0_Handler,32		; g_pfnVectors[29] @ 928
	.bits	ADC0Seq0_Handler,32		; g_pfnVectors[30] @ 960
	.bits	ADC0Seq1_Handler,32		; g_pfnVectors[31] @ 992
	.bits	ADC0Seq2_Handler,32		; g_pfnVectors[32] @ 1024
	.bits	ADC0Seq3_Handler,32		; g_pfnVectors[33] @ 1056
	.bits	WDT_Handler,32		; g_pfnVectors[34] @ 1088
	.bits	Timer0A_Handler,32		; g_pfnVectors[35] @ 1120
	.bits	Timer0B_Handler,32		; g_pfnVectors[36] @ 1152
	.bits	Timer1A_Handler,32		; g_pfnVectors[37] @ 1184
	.bits	Timer1B_Handler,32		; g_pfnVectors[38] @ 1216
	.bits	Timer2A_Handler,32		; g_pfnVectors[39] @ 1248
	.bits	Timer2B_Handler,32		; g_pfnVectors[40] @ 1280
	.bits	Comp0_Handler,32		; g_pfnVectors[41] @ 1312
	.bits	Comp1_Handler,32		; g_pfnVectors[42] @ 1344
	.bits	Comp2_Handler,32		; g_pfnVectors[43] @ 1376
	.bits	SysCtl_Handler,32		; g_pfnVectors[44] @ 1408
	.bits	FlashCtl_Handler,32		; g_pfnVectors[45] @ 1440
	.bits	GPIOPortF_Handler,32		; g_pfnVectors[46] @ 1472
	.bits	GPIOPortG_Handler,32		; g_pfnVectors[47] @ 1504
	.bits	GPIOPortH_Handler,32		; g_pfnVectors[48] @ 1536
	.bits	UART2_Handler,32		; g_pfnVectors[49] @ 1568
	.bits	SSI1_Handler,32		; g_pfnVectors[50] @ 1600
	.bits	Timer3A_Handler,32		; g_pfnVectors[51] @ 1632
	.bits	Timer3B_Handler,32		; g_pfnVectors[52] @ 1664
	.bits	I2C1_Handler,32		; g_pfnVectors[53] @ 1696
	.bits	Quadrature1_Handler,32		; g_pfnVectors[54] @ 1728
	.bits	CAN0_Handler,32		; g_pfnVectors[55] @ 1760
	.bits	CAN1_Handler,32		; g_pfnVectors[56] @ 1792
	.bits	CAN2_Handler,32		; g_pfnVectors[57] @ 1824
	.bits	Ethernet_Handler,32		; g_pfnVectors[58] @ 1856
	.bits	Hibernate_Handler,32		; g_pfnVectors[59] @ 1888
	.bits	USB0_Handler,32		; g_pfnVectors[60] @ 1920
	.bits	PWM0Generator3_Handler,32		; g_pfnVectors[61] @ 1952
	.bits	uDMA_Handler,32		; g_pfnVectors[62] @ 1984
	.bits	uDMA_Error,32		; g_pfnVectors[63] @ 2016
	.bits	ADC1Seq0_Handler,32		; g_pfnVectors[64] @ 2048
	.bits	ADC1Seq1_Handler,32		; g_pfnVectors[65] @ 2080
	.bits	ADC1Seq2_Handler,32		; g_pfnVectors[66] @ 2112
	.bits	ADC1Seq3_Handler,32		; g_pfnVectors[67] @ 2144
	.bits	I2S0_Handler,32		; g_pfnVectors[68] @ 2176
	.bits	ExtBus_Handler,32		; g_pfnVectors[69] @ 2208
	.bits	GPIOPortJ_Handler,32		; g_pfnVectors[70] @ 2240
	.bits	GPIOPortK_Handler,32		; g_pfnVectors[71] @ 2272
	.bits	GPIOPortL_Handler,32		; g_pfnVectors[72] @ 2304
	.bits	SSI2_Handler,32		; g_pfnVectors[73] @ 2336
	.bits	SSI3_Handler,32		; g_pfnVectors[74] @ 2368
	.bits	UART3_Handler,32		; g_pfnVectors[75] @ 2400
	.bits	UART4_Handler,32		; g_pfnVectors[76] @ 2432
	.bits	UART5_Handler,32		; g_pfnVectors[77] @ 2464
	.bits	UART6_Handler,32		; g_pfnVectors[78] @ 2496
	.bits	UART7_Handler,32		; g_pfnVectors[79] @ 2528
	.bits	0,32			; g_pfnVectors[80] @ 2560
	.bits	0,32			; g_pfnVectors[81] @ 2592
	.bits	0,32			; g_pfnVectors[82] @ 2624
	.bits	0,32			; g_pfnVectors[83] @ 2656
	.bits	I2C2_Handler,32		; g_pfnVectors[84] @ 2688
	.bits	I2C3_Handler,32		; g_pfnVectors[85] @ 2720
	.bits	Timer4A_Handler,32		; g_pfnVectors[86] @ 2752
	.bits	Timer4B_Handler,32		; g_pfnVectors[87] @ 2784
	.bits	0,32			; g_pfnVectors[88] @ 2816
	.bits	0,32			; g_pfnVectors[89] @ 2848
	.bits	0,32			; g_pfnVectors[90] @ 2880
	.bits	0,32			; g_pfnVectors[91] @ 2912
	.bits	0,32			; g_pfnVectors[92] @ 2944
	.bits	0,32			; g_pfnVectors[93] @ 2976
	.bits	0,32			; g_pfnVectors[94] @ 3008
	.bits	0,32			; g_pfnVectors[95] @ 3040
	.bits	0,32			; g_pfnVectors[96] @ 3072
	.bits	0,32			; g_pfnVectors[97] @ 3104
	.bits	0,32			; g_pfnVectors[98] @ 3136
	.bits	0,32			; g_pfnVectors[99] @ 3168
	.bits	0,32			; g_pfnVectors[100] @ 3200
	.bits	0,32			; g_pfnVectors[101] @ 3232
	.bits	0,32			; g_pfnVectors[102] @ 3264
	.bits	0,32			; g_pfnVectors[103] @ 3296
	.bits	0,32			; g_pfnVectors[104] @ 3328
	.bits	0,32			; g_pfnVectors[105] @ 3360
	.bits	0,32			; g_pfnVectors[106] @ 3392
	.bits	0,32			; g_pfnVectors[107] @ 3424
	.bits	Timer5A_Handler,32		; g_pfnVectors[108] @ 3456
	.bits	Timer5B_Handler,32		; g_pfnVectors[109] @ 3488
	.bits	WideTimer0A_Handler,32		; g_pfnVectors[110] @ 3520
	.bits	WideTimer0B_Handler,32		; g_pfnVectors[111] @ 3552
	.bits	WideTimer1A_Handler,32		; g_pfnVectors[112] @ 3584
	.bits	WideTimer1B_Handler,32		; g_pfnVectors[113] @ 3616
	.bits	WideTimer2A_Handler,32		; g_pfnVectors[114] @ 3648
	.bits	WideTimer2B_Handler,32		; g_pfnVectors[115] @ 3680
	.bits	WideTimer3A_Handler,32		; g_pfnVectors[116] @ 3712
	.bits	WideTimer3B_Handler,32		; g_pfnVectors[117] @ 3744
	.bits	WideTimer4A_Handler,32		; g_pfnVectors[118] @ 3776
	.bits	WideTimer4B_Handler,32		; g_pfnVectors[119] @ 3808
	.bits	WideTimer5A_Handler,32		; g_pfnVectors[120] @ 3840
	.bits	WideTimer5B_Handler,32		; g_pfnVectors[121] @ 3872
	.bits	FPU_Handler,32		; g_pfnVectors[122] @ 3904
	.bits	PECI0_Handler,32		; g_pfnVectors[123] @ 3936
	.bits	LPC0_Handler,32		; g_pfnVectors[124] @ 3968
	.bits	I2C4_Handler,32		; g_pfnVectors[125] @ 4000
	.bits	I2C5_Handler,32		; g_pfnVectors[126] @ 4032
	.bits	GPIOPortM_Handler,32		; g_pfnVectors[127] @ 4064
	.bits	GPIOPortN_Handler,32		; g_pfnVectors[128] @ 4096
	.bits	Quadrature2_Handler,32		; g_pfnVectors[129] @ 4128
	.bits	Fan0_Handler,32		; g_pfnVectors[130] @ 4160
	.bits	0,32			; g_pfnVectors[131] @ 4192
	.bits	GPIOPortP_Handler,32		; g_pfnVectors[132] @ 4224
	.bits	GPIOPortP1_Handler,32		; g_pfnVectors[133] @ 4256
	.bits	GPIOPortP2_Handler,32		; g_pfnVectors[134] @ 4288
	.bits	GPIOPortP3_Handler,32		; g_pfnVectors[135] @ 4320
	.bits	GPIOPortP4_Handler,32		; g_pfnVectors[136] @ 4352
	.bits	GPIOPortP5_Handler,32		; g_pfnVectors[137] @ 4384
	.bits	GPIOPortP6_Handler,32		; g_pfnVectors[138] @ 4416
	.bits	GPIOPortP7_Handler,32		; g_pfnVectors[139] @ 4448
	.bits	GPIOPortQ_Handler,32		; g_pfnVectors[140] @ 4480
	.bits	GPIOPortQ1_Handler,32		; g_pfnVectors[141] @ 4512
	.bits	GPIOPortQ2_Handler,32		; g_pfnVectors[142] @ 4544
	.bits	GPIOPortQ3_Handler,32		; g_pfnVectors[143] @ 4576
	.bits	GPIOPortQ4_Handler,32		; g_pfnVectors[144] @ 4608
	.bits	GPIOPortQ5_Handler,32		; g_pfnVectors[145] @ 4640
	.bits	GPIOPortQ6_Handler,32		; g_pfnVectors[146] @ 4672
	.bits	GPIOPortQ7_Handler,32		; g_pfnVectors[147] @ 4704
	.bits	GPIOPortR_Handler,32		; g_pfnVectors[148] @ 4736
	.bits	GPIOPortS_Handler,32		; g_pfnVectors[149] @ 4768
	.bits	PWM1Generator0_Handler,32		; g_pfnVectors[150] @ 4800
	.bits	PWM1Generator1_Handler,32		; g_pfnVectors[151] @ 4832
	.bits	PWM1Generator2_Handler,32		; g_pfnVectors[152] @ 4864
	.bits	PWM1Generator3_Handler,32		; g_pfnVectors[153] @ 4896
	.bits	PWM1Fault_Handler,32		; g_pfnVectors[154] @ 4928

$C$DW$2	.dwtag  DW_TAG_variable
	.dwattr $C$DW$2, DW_AT_name("g_pfnVectors")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("g_pfnVectors")
	.dwattr $C$DW$2, DW_AT_location[DW_OP_addr g_pfnVectors]
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$2, DW_AT_external
	.dwattr $C$DW$2, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$2, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$2, DW_AT_decl_column(0x0f)

;	D:\EngineeringSoftware\CCS\ccsv7\tools\compiler\ti-cgt-arm_16.9.0.LTS\bin\armacpia.exe -@C:\\Users\\Glenn\\AppData\\Local\\Temp\\1250412 
	.sect	".text"
	.clink
	.thumbfunc ResetISR
	.thumb
	.global	ResetISR

$C$DW$3	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$3, DW_AT_name("ResetISR")
	.dwattr $C$DW$3, DW_AT_low_pc(ResetISR)
	.dwattr $C$DW$3, DW_AT_high_pc(0x00)
	.dwattr $C$DW$3, DW_AT_TI_symbol_name("ResetISR")
	.dwattr $C$DW$3, DW_AT_external
	.dwattr $C$DW$3, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$3, DW_AT_TI_begin_line(0x173)
	.dwattr $C$DW$3, DW_AT_TI_begin_column(0x01)
	.dwattr $C$DW$3, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$3, DW_AT_decl_line(0x173)
	.dwattr $C$DW$3, DW_AT_decl_column(0x01)
	.dwattr $C$DW$3, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 372,column 1,is_stmt,address ResetISR,isa 1

	.dwfde $C$DW$CIE, ResetISR
;----------------------------------------------------------------------
; 371 | ResetISR(void)                                                         
; 373 | //                                                                     
; 374 | // Jump to the CCS C initialization routine.  This will enable the     
; 375 | // floating-point unit as well, so that does not need to be done here. 
; 376 | //                                                                     
;----------------------------------------------------------------------

