glennlopez/EmbeddedSystems.Playground/Texas Instruments/TM4C123G/Projects/GPIO_4C123/Debug/tm4c123gh6pm_startup_ccs.asm
;*****************************************************************************
;* FUNCTION NAME: Comp2_Handler                                              *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
Comp2_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 470,column 33,is_stmt,isa 1
;----------------------------------------------------------------------
; 470 | void Comp2_Handler(void){ while(1){}}              // Analog Comp 2    
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L35||
;*
;*   Loop source line                : 470
;*   Loop closing brace source line  : 470
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L35||:    
        B         ||$C$L35||            ; [DPU_3_PIPE] |470| 
        ; BRANCH OCCURS {||$C$L35||}     ; [] |470| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$39, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$39, DW_AT_TI_end_line(0x1d6)
	.dwattr $C$DW$39, DW_AT_TI_end_column(0x25)
	.dwendentry
	.dwendtag $C$DW$39

	.sect	".text"
	.clink
	.thumbfunc SysCtl_Handler
	.thumb
	.weak	SysCtl_Handler

$C$DW$40	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$40, DW_AT_name("SysCtl_Handler")
	.dwattr $C$DW$40, DW_AT_low_pc(SysCtl_Handler)
	.dwattr $C$DW$40, DW_AT_high_pc(0x00)
	.dwattr $C$DW$40, DW_AT_TI_symbol_name("SysCtl_Handler")
	.dwattr $C$DW$40, DW_AT_external
	.dwattr $C$DW$40, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$40, DW_AT_TI_begin_line(0x1d7)
	.dwattr $C$DW$40, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$40, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$40, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$40, DW_AT_decl_column(0x06)
	.dwattr $C$DW$40, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 471,column 26,is_stmt,address SysCtl_Handler,isa 1

	.dwfde $C$DW$CIE, SysCtl_Handler

;*****************************************************************************
;* FUNCTION NAME: SysCtl_Handler                                             *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
SysCtl_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 471,column 34,is_stmt,isa 1
;----------------------------------------------------------------------
; 471 | void SysCtl_Handler(void){ while(1){}}             // System Control   
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L36||
;*
;*   Loop source line                : 471
;*   Loop closing brace source line  : 471
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L36||:    
        B         ||$C$L36||            ; [DPU_3_PIPE] |471| 
        ; BRANCH OCCURS {||$C$L36||}     ; [] |471| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$40, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$40, DW_AT_TI_end_line(0x1d7)
	.dwattr $C$DW$40, DW_AT_TI_end_column(0x26)
	.dwendentry
	.dwendtag $C$DW$40

	.sect	".text"
	.clink
	.thumbfunc FlashCtl_Handler
	.thumb
	.weak	FlashCtl_Handler

$C$DW$41	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$41, DW_AT_name("FlashCtl_Handler")
	.dwattr $C$DW$41, DW_AT_low_pc(FlashCtl_Handler)
	.dwattr $C$DW$41, DW_AT_high_pc(0x00)
	.dwattr $C$DW$41, DW_AT_TI_symbol_name("FlashCtl_Handler")
	.dwattr $C$DW$41, DW_AT_external
	.dwattr $C$DW$41, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$41, DW_AT_TI_begin_line(0x1d8)
	.dwattr $C$DW$41, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$41, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$41, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$41, DW_AT_decl_column(0x06)
	.dwattr $C$DW$41, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 472,column 28,is_stmt,address FlashCtl_Handler,isa 1

	.dwfde $C$DW$CIE, FlashCtl_Handler

;*****************************************************************************
;* FUNCTION NAME: FlashCtl_Handler                                           *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
FlashCtl_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 472,column 36,is_stmt,isa 1
;----------------------------------------------------------------------
; 472 | void FlashCtl_Handler(void){ while(1){}}           // Flash Control    
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L37||
;*
;*   Loop source line                : 472
;*   Loop closing brace source line  : 472
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L37||:    
        B         ||$C$L37||            ; [DPU_3_PIPE] |472| 
        ; BRANCH OCCURS {||$C$L37||}     ; [] |472| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$41, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$41, DW_AT_TI_end_line(0x1d8)
	.dwattr $C$DW$41, DW_AT_TI_end_column(0x28)
	.dwendentry
	.dwendtag $C$DW$41

	.sect	".text"
	.clink
	.thumbfunc GPIOPortF_Handler
	.thumb
	.weak	GPIOPortF_Handler

