glennlopez/EmbeddedSystems.Playground/Texas Instruments/TM4C123G/Projects/GPIO_4C123/Debug/tm4c123gh6pm_startup_ccs.asm
;*****************************************************************************
;* FUNCTION NAME: GPIOPortH_Handler                                          *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
GPIOPortH_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 475,column 37,is_stmt,isa 1
;----------------------------------------------------------------------
; 475 | void GPIOPortH_Handler(void){ while(1){}}          // GPIO Port H      
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L40||
;*
;*   Loop source line                : 475
;*   Loop closing brace source line  : 475
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L40||:    
        B         ||$C$L40||            ; [DPU_3_PIPE] |475| 
        ; BRANCH OCCURS {||$C$L40||}     ; [] |475| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$44, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$44, DW_AT_TI_end_line(0x1db)
	.dwattr $C$DW$44, DW_AT_TI_end_column(0x29)
	.dwendentry
	.dwendtag $C$DW$44

	.sect	".text"
	.clink
	.thumbfunc UART2_Handler
	.thumb
	.weak	UART2_Handler

$C$DW$45	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$45, DW_AT_name("UART2_Handler")
	.dwattr $C$DW$45, DW_AT_low_pc(UART2_Handler)
	.dwattr $C$DW$45, DW_AT_high_pc(0x00)
	.dwattr $C$DW$45, DW_AT_TI_symbol_name("UART2_Handler")
	.dwattr $C$DW$45, DW_AT_external
	.dwattr $C$DW$45, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$45, DW_AT_TI_begin_line(0x1dc)
	.dwattr $C$DW$45, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$45, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$45, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$45, DW_AT_decl_column(0x06)
	.dwattr $C$DW$45, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 476,column 25,is_stmt,address UART2_Handler,isa 1

	.dwfde $C$DW$CIE, UART2_Handler

;*****************************************************************************
;* FUNCTION NAME: UART2_Handler                                              *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
UART2_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 476,column 33,is_stmt,isa 1
;----------------------------------------------------------------------
; 476 | void UART2_Handler(void){ while(1){}}              // UART2 Rx and Tx  
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L41||
;*
;*   Loop source line                : 476
;*   Loop closing brace source line  : 476
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L41||:    
        B         ||$C$L41||            ; [DPU_3_PIPE] |476| 
        ; BRANCH OCCURS {||$C$L41||}     ; [] |476| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$45, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$45, DW_AT_TI_end_line(0x1dc)
	.dwattr $C$DW$45, DW_AT_TI_end_column(0x25)
	.dwendentry
	.dwendtag $C$DW$45

	.sect	".text"
	.clink
	.thumbfunc SSI1_Handler
	.thumb
	.weak	SSI1_Handler

$C$DW$46	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$46, DW_AT_name("SSI1_Handler")
	.dwattr $C$DW$46, DW_AT_low_pc(SSI1_Handler)
	.dwattr $C$DW$46, DW_AT_high_pc(0x00)
	.dwattr $C$DW$46, DW_AT_TI_symbol_name("SSI1_Handler")
	.dwattr $C$DW$46, DW_AT_external
	.dwattr $C$DW$46, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$46, DW_AT_TI_begin_line(0x1dd)
	.dwattr $C$DW$46, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$46, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$46, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$46, DW_AT_decl_column(0x06)
	.dwattr $C$DW$46, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 477,column 24,is_stmt,address SSI1_Handler,isa 1

	.dwfde $C$DW$CIE, SSI1_Handler

;*****************************************************************************
;* FUNCTION NAME: SSI1_Handler                                               *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
SSI1_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 477,column 32,is_stmt,isa 1
;----------------------------------------------------------------------
; 477 | void SSI1_Handler(void){ while(1){}}               // SSI1 Rx and Tx   
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L42||
;*
;*   Loop source line                : 477
;*   Loop closing brace source line  : 477
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L42||:    
        B         ||$C$L42||            ; [DPU_3_PIPE] |477| 
        ; BRANCH OCCURS {||$C$L42||}     ; [] |477| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$46, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$46, DW_AT_TI_end_line(0x1dd)
	.dwattr $C$DW$46, DW_AT_TI_end_column(0x24)
	.dwendentry
	.dwendtag $C$DW$46

	.sect	".text"
	.clink
	.thumbfunc Timer3A_Handler
	.thumb
	.weak	Timer3A_Handler

