glennlopez/EmbeddedSystems.Playground/Texas Instruments/TM4C123G/Projects/GPIO_4C123/Debug/tm4c123gh6pm_startup_ccs.asm
;*****************************************************************************
;* FUNCTION NAME: I2C1_Handler                                               *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
I2C1_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 480,column 32,is_stmt,isa 1
;----------------------------------------------------------------------
; 480 | void I2C1_Handler(void){ while(1){}}               // I2C1 Master and S
;     | lave                                                                   
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L45||
;*
;*   Loop source line                : 480
;*   Loop closing brace source line  : 480
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L45||:    
        B         ||$C$L45||            ; [DPU_3_PIPE] |480| 
        ; BRANCH OCCURS {||$C$L45||}     ; [] |480| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$49, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$49, DW_AT_TI_end_line(0x1e0)
	.dwattr $C$DW$49, DW_AT_TI_end_column(0x24)
	.dwendentry
	.dwendtag $C$DW$49

	.sect	".text"
	.clink
	.thumbfunc Quadrature1_Handler
	.thumb
	.weak	Quadrature1_Handler

$C$DW$50	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$50, DW_AT_name("Quadrature1_Handler")
	.dwattr $C$DW$50, DW_AT_low_pc(Quadrature1_Handler)
	.dwattr $C$DW$50, DW_AT_high_pc(0x00)
	.dwattr $C$DW$50, DW_AT_TI_symbol_name("Quadrature1_Handler")
	.dwattr $C$DW$50, DW_AT_external
	.dwattr $C$DW$50, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$50, DW_AT_TI_begin_line(0x1e1)
	.dwattr $C$DW$50, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$50, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$50, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$50, DW_AT_decl_column(0x06)
	.dwattr $C$DW$50, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 481,column 31,is_stmt,address Quadrature1_Handler,isa 1

	.dwfde $C$DW$CIE, Quadrature1_Handler

;*****************************************************************************
;* FUNCTION NAME: Quadrature1_Handler                                        *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
Quadrature1_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 481,column 39,is_stmt,isa 1
;----------------------------------------------------------------------
; 481 | void Quadrature1_Handler(void){ while(1){}}        // Quadrature Encode
;     | r 1                                                                    
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L46||
;*
;*   Loop source line                : 481
;*   Loop closing brace source line  : 481
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L46||:    
        B         ||$C$L46||            ; [DPU_3_PIPE] |481| 
        ; BRANCH OCCURS {||$C$L46||}     ; [] |481| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$50, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$50, DW_AT_TI_end_line(0x1e1)
	.dwattr $C$DW$50, DW_AT_TI_end_column(0x2b)
	.dwendentry
	.dwendtag $C$DW$50

	.sect	".text"
	.clink
	.thumbfunc CAN0_Handler
	.thumb
	.weak	CAN0_Handler

$C$DW$51	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$51, DW_AT_name("CAN0_Handler")
	.dwattr $C$DW$51, DW_AT_low_pc(CAN0_Handler)
	.dwattr $C$DW$51, DW_AT_high_pc(0x00)
	.dwattr $C$DW$51, DW_AT_TI_symbol_name("CAN0_Handler")
	.dwattr $C$DW$51, DW_AT_external
	.dwattr $C$DW$51, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$51, DW_AT_TI_begin_line(0x1e2)
	.dwattr $C$DW$51, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$51, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$51, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$51, DW_AT_decl_column(0x06)
	.dwattr $C$DW$51, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 482,column 24,is_stmt,address CAN0_Handler,isa 1

	.dwfde $C$DW$CIE, CAN0_Handler

;*****************************************************************************
;* FUNCTION NAME: CAN0_Handler                                               *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
CAN0_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 482,column 32,is_stmt,isa 1
;----------------------------------------------------------------------
; 482 | void CAN0_Handler(void){ while(1){}}               // CAN0             
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L47||
;*
;*   Loop source line                : 482
;*   Loop closing brace source line  : 482
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L47||:    
        B         ||$C$L47||            ; [DPU_3_PIPE] |482| 
        ; BRANCH OCCURS {||$C$L47||}     ; [] |482| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$51, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$51, DW_AT_TI_end_line(0x1e2)
	.dwattr $C$DW$51, DW_AT_TI_end_column(0x24)
	.dwendentry
	.dwendtag $C$DW$51

	.sect	".text"
	.clink
	.thumbfunc CAN1_Handler
	.thumb
	.weak	CAN1_Handler

$C$DW$52	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$52, DW_AT_name("CAN1_Handler")
	.dwattr $C$DW$52, DW_AT_low_pc(CAN1_Handler)
	.dwattr $C$DW$52, DW_AT_high_pc(0x00)
	.dwattr $C$DW$52, DW_AT_TI_symbol_name("CAN1_Handler")
	.dwattr $C$DW$52, DW_AT_external
	.dwattr $C$DW$52, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$52, DW_AT_TI_begin_line(0x1e3)
	.dwattr $C$DW$52, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$52, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$52, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$52, DW_AT_decl_column(0x06)
	.dwattr $C$DW$52, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 483,column 24,is_stmt,address CAN1_Handler,isa 1

	.dwfde $C$DW$CIE, CAN1_Handler

