glennlopez/EmbeddedSystems.Playground/Texas Instruments/TM4C123G/Projects/GPIO_4C123/Debug/tm4c123gh6pm_startup_ccs.asm
;*****************************************************************************
;* FUNCTION NAME: uDMA_Handler                                               *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
uDMA_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 489,column 32,is_stmt,isa 1
;----------------------------------------------------------------------
; 489 | void uDMA_Handler(void){ while(1){}}               // uDMA Software Tra
;     | nsfer                                                                  
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L54||
;*
;*   Loop source line                : 489
;*   Loop closing brace source line  : 489
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L54||:    
        B         ||$C$L54||            ; [DPU_3_PIPE] |489| 
        ; BRANCH OCCURS {||$C$L54||}     ; [] |489| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$58, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$58, DW_AT_TI_end_line(0x1e9)
	.dwattr $C$DW$58, DW_AT_TI_end_column(0x24)
	.dwendentry
	.dwendtag $C$DW$58

	.sect	".text"
	.clink
	.thumbfunc uDMA_Error
	.thumb
	.weak	uDMA_Error

$C$DW$59	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$59, DW_AT_name("uDMA_Error")
	.dwattr $C$DW$59, DW_AT_low_pc(uDMA_Error)
	.dwattr $C$DW$59, DW_AT_high_pc(0x00)
	.dwattr $C$DW$59, DW_AT_TI_symbol_name("uDMA_Error")
	.dwattr $C$DW$59, DW_AT_external
	.dwattr $C$DW$59, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$59, DW_AT_TI_begin_line(0x1ea)
	.dwattr $C$DW$59, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$59, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$59, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$59, DW_AT_decl_column(0x06)
	.dwattr $C$DW$59, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 490,column 22,is_stmt,address uDMA_Error,isa 1

	.dwfde $C$DW$CIE, uDMA_Error

;*****************************************************************************
;* FUNCTION NAME: uDMA_Error                                                 *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
uDMA_Error:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 490,column 30,is_stmt,isa 1
;----------------------------------------------------------------------
; 490 | void uDMA_Error(void){ while(1){}}                 // uDMA Error       
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L55||
;*
;*   Loop source line                : 490
;*   Loop closing brace source line  : 490
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L55||:    
        B         ||$C$L55||            ; [DPU_3_PIPE] |490| 
        ; BRANCH OCCURS {||$C$L55||}     ; [] |490| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$59, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$59, DW_AT_TI_end_line(0x1ea)
	.dwattr $C$DW$59, DW_AT_TI_end_column(0x22)
	.dwendentry
	.dwendtag $C$DW$59

	.sect	".text"
	.clink
	.thumbfunc ADC1Seq0_Handler
	.thumb
	.weak	ADC1Seq0_Handler

$C$DW$60	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$60, DW_AT_name("ADC1Seq0_Handler")
	.dwattr $C$DW$60, DW_AT_low_pc(ADC1Seq0_Handler)
	.dwattr $C$DW$60, DW_AT_high_pc(0x00)
	.dwattr $C$DW$60, DW_AT_TI_symbol_name("ADC1Seq0_Handler")
	.dwattr $C$DW$60, DW_AT_external
	.dwattr $C$DW$60, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$60, DW_AT_TI_begin_line(0x1eb)
	.dwattr $C$DW$60, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$60, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$60, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$60, DW_AT_decl_column(0x06)
	.dwattr $C$DW$60, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 491,column 28,is_stmt,address ADC1Seq0_Handler,isa 1

	.dwfde $C$DW$CIE, ADC1Seq0_Handler

;*****************************************************************************
;* FUNCTION NAME: ADC1Seq0_Handler                                           *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
ADC1Seq0_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 491,column 36,is_stmt,isa 1
;----------------------------------------------------------------------
; 491 | void ADC1Seq0_Handler(void){ while(1){}}           // ADC1 Sequence 0  
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L56||
;*
;*   Loop source line                : 491
;*   Loop closing brace source line  : 491
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L56||:    
        B         ||$C$L56||            ; [DPU_3_PIPE] |491| 
        ; BRANCH OCCURS {||$C$L56||}     ; [] |491| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$60, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$60, DW_AT_TI_end_line(0x1eb)
	.dwattr $C$DW$60, DW_AT_TI_end_column(0x28)
	.dwendentry
	.dwendtag $C$DW$60

	.sect	".text"
	.clink
	.thumbfunc ADC1Seq1_Handler
	.thumb
	.weak	ADC1Seq1_Handler

$C$DW$61	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$61, DW_AT_name("ADC1Seq1_Handler")
	.dwattr $C$DW$61, DW_AT_low_pc(ADC1Seq1_Handler)
	.dwattr $C$DW$61, DW_AT_high_pc(0x00)
	.dwattr $C$DW$61, DW_AT_TI_symbol_name("ADC1Seq1_Handler")
	.dwattr $C$DW$61, DW_AT_external
	.dwattr $C$DW$61, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$61, DW_AT_TI_begin_line(0x1ec)
	.dwattr $C$DW$61, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$61, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$61, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$61, DW_AT_decl_column(0x06)
	.dwattr $C$DW$61, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 492,column 28,is_stmt,address ADC1Seq1_Handler,isa 1

	.dwfde $C$DW$CIE, ADC1Seq1_Handler

