glennlopez/EmbeddedSystems.Playground/Texas Instruments/TM4C123G/Projects/GPIO_4C123/Debug/tm4c123gh6pm_startup_ccs.asm
;*****************************************************************************
;* FUNCTION NAME: I2C2_Handler                                               *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
I2C2_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 507,column 32,is_stmt,isa 1
;----------------------------------------------------------------------
; 507 | void I2C2_Handler(void){ while(1){}}               // I2C2 Master and S
;     | lave                                                                   
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L72||
;*
;*   Loop source line                : 507
;*   Loop closing brace source line  : 507
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L72||:    
        B         ||$C$L72||            ; [DPU_3_PIPE] |507| 
        ; BRANCH OCCURS {||$C$L72||}     ; [] |507| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$76, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$76, DW_AT_TI_end_line(0x1fb)
	.dwattr $C$DW$76, DW_AT_TI_end_column(0x24)
	.dwendentry
	.dwendtag $C$DW$76

	.sect	".text"
	.clink
	.thumbfunc I2C3_Handler
	.thumb
	.weak	I2C3_Handler

$C$DW$77	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$77, DW_AT_name("I2C3_Handler")
	.dwattr $C$DW$77, DW_AT_low_pc(I2C3_Handler)
	.dwattr $C$DW$77, DW_AT_high_pc(0x00)
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("I2C3_Handler")
	.dwattr $C$DW$77, DW_AT_external
	.dwattr $C$DW$77, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$77, DW_AT_TI_begin_line(0x1fc)
	.dwattr $C$DW$77, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$77, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$77, DW_AT_decl_line(0x1fc)
	.dwattr $C$DW$77, DW_AT_decl_column(0x06)
	.dwattr $C$DW$77, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 508,column 24,is_stmt,address I2C3_Handler,isa 1

	.dwfde $C$DW$CIE, I2C3_Handler

;*****************************************************************************
;* FUNCTION NAME: I2C3_Handler                                               *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
I2C3_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 508,column 32,is_stmt,isa 1
;----------------------------------------------------------------------
; 508 | void I2C3_Handler(void){ while(1){}}               // I2C3 Master and S
;     | lave                                                                   
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L73||
;*
;*   Loop source line                : 508
;*   Loop closing brace source line  : 508
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L73||:    
        B         ||$C$L73||            ; [DPU_3_PIPE] |508| 
        ; BRANCH OCCURS {||$C$L73||}     ; [] |508| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$77, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$77, DW_AT_TI_end_line(0x1fc)
	.dwattr $C$DW$77, DW_AT_TI_end_column(0x24)
	.dwendentry
	.dwendtag $C$DW$77

	.sect	".text"
	.clink
	.thumbfunc Timer4A_Handler
	.thumb
	.weak	Timer4A_Handler

$C$DW$78	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$78, DW_AT_name("Timer4A_Handler")
	.dwattr $C$DW$78, DW_AT_low_pc(Timer4A_Handler)
	.dwattr $C$DW$78, DW_AT_high_pc(0x00)
	.dwattr $C$DW$78, DW_AT_TI_symbol_name("Timer4A_Handler")
	.dwattr $C$DW$78, DW_AT_external
	.dwattr $C$DW$78, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$78, DW_AT_TI_begin_line(0x1fd)
	.dwattr $C$DW$78, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$78, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$78, DW_AT_decl_line(0x1fd)
	.dwattr $C$DW$78, DW_AT_decl_column(0x06)
	.dwattr $C$DW$78, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 509,column 27,is_stmt,address Timer4A_Handler,isa 1

	.dwfde $C$DW$CIE, Timer4A_Handler

;*****************************************************************************
;* FUNCTION NAME: Timer4A_Handler                                            *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
Timer4A_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 509,column 35,is_stmt,isa 1
;----------------------------------------------------------------------
; 509 | void Timer4A_Handler(void){ while(1){}}            // Timer 4 subtimer
;     | A                                                                      
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L74||
;*
;*   Loop source line                : 509
;*   Loop closing brace source line  : 509
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L74||:    
        B         ||$C$L74||            ; [DPU_3_PIPE] |509| 
        ; BRANCH OCCURS {||$C$L74||}     ; [] |509| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$78, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$78, DW_AT_TI_end_line(0x1fd)
	.dwattr $C$DW$78, DW_AT_TI_end_column(0x27)
	.dwendentry
	.dwendtag $C$DW$78

	.sect	".text"
	.clink
	.thumbfunc Timer4B_Handler
	.thumb
	.weak	Timer4B_Handler

$C$DW$79	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$79, DW_AT_name("Timer4B_Handler")
	.dwattr $C$DW$79, DW_AT_low_pc(Timer4B_Handler)
	.dwattr $C$DW$79, DW_AT_high_pc(0x00)
	.dwattr $C$DW$79, DW_AT_TI_symbol_name("Timer4B_Handler")
	.dwattr $C$DW$79, DW_AT_external
	.dwattr $C$DW$79, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$79, DW_AT_TI_begin_line(0x1fe)
	.dwattr $C$DW$79, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$79, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$79, DW_AT_decl_line(0x1fe)
	.dwattr $C$DW$79, DW_AT_decl_column(0x06)
	.dwattr $C$DW$79, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 510,column 27,is_stmt,address Timer4B_Handler,isa 1

	.dwfde $C$DW$CIE, Timer4B_Handler

