glennlopez/EmbeddedSystems.Playground/Texas Instruments/TM4C123G/Projects/GPIO_4C123/Debug/tm4c123gh6pm_startup_ccs.asm
$C$DW$82	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$82, DW_AT_name("WideTimer0A_Handler")
	.dwattr $C$DW$82, DW_AT_low_pc(WideTimer0A_Handler)
	.dwattr $C$DW$82, DW_AT_high_pc(0x00)
	.dwattr $C$DW$82, DW_AT_TI_symbol_name("WideTimer0A_Handler")
	.dwattr $C$DW$82, DW_AT_external
	.dwattr $C$DW$82, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$82, DW_AT_TI_begin_line(0x201)
	.dwattr $C$DW$82, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$82, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$82, DW_AT_decl_line(0x201)
	.dwattr $C$DW$82, DW_AT_decl_column(0x06)
	.dwattr $C$DW$82, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 513,column 31,is_stmt,address WideTimer0A_Handler,isa 1

	.dwfde $C$DW$CIE, WideTimer0A_Handler

;*****************************************************************************
;* FUNCTION NAME: WideTimer0A_Handler                                        *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
WideTimer0A_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 513,column 39,is_stmt,isa 1
;----------------------------------------------------------------------
; 513 | void WideTimer0A_Handler(void){ while(1){}}        // Wide Timer 0 subt
;     | imer A                                                                 
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L78||
;*
;*   Loop source line                : 513
;*   Loop closing brace source line  : 513
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L78||:    
        B         ||$C$L78||            ; [DPU_3_PIPE] |513| 
        ; BRANCH OCCURS {||$C$L78||}     ; [] |513| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$82, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$82, DW_AT_TI_end_line(0x201)
	.dwattr $C$DW$82, DW_AT_TI_end_column(0x2b)
	.dwendentry
	.dwendtag $C$DW$82

	.sect	".text"
	.clink
	.thumbfunc WideTimer0B_Handler
	.thumb
	.weak	WideTimer0B_Handler

$C$DW$83	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$83, DW_AT_name("WideTimer0B_Handler")
	.dwattr $C$DW$83, DW_AT_low_pc(WideTimer0B_Handler)
	.dwattr $C$DW$83, DW_AT_high_pc(0x00)
	.dwattr $C$DW$83, DW_AT_TI_symbol_name("WideTimer0B_Handler")
	.dwattr $C$DW$83, DW_AT_external
	.dwattr $C$DW$83, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$83, DW_AT_TI_begin_line(0x202)
	.dwattr $C$DW$83, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$83, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$83, DW_AT_decl_line(0x202)
	.dwattr $C$DW$83, DW_AT_decl_column(0x06)
	.dwattr $C$DW$83, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 514,column 31,is_stmt,address WideTimer0B_Handler,isa 1

	.dwfde $C$DW$CIE, WideTimer0B_Handler

;*****************************************************************************
;* FUNCTION NAME: WideTimer0B_Handler                                        *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
WideTimer0B_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 514,column 39,is_stmt,isa 1
;----------------------------------------------------------------------
; 514 | void WideTimer0B_Handler(void){ while(1){}}        // Wide Timer 0 subt
;     | imer B                                                                 
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L79||
;*
;*   Loop source line                : 514
;*   Loop closing brace source line  : 514
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L79||:    
        B         ||$C$L79||            ; [DPU_3_PIPE] |514| 
        ; BRANCH OCCURS {||$C$L79||}     ; [] |514| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$83, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$83, DW_AT_TI_end_line(0x202)
	.dwattr $C$DW$83, DW_AT_TI_end_column(0x2b)
	.dwendentry
	.dwendtag $C$DW$83

	.sect	".text"
	.clink
	.thumbfunc WideTimer1A_Handler
	.thumb
	.weak	WideTimer1A_Handler

$C$DW$84	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$84, DW_AT_name("WideTimer1A_Handler")
	.dwattr $C$DW$84, DW_AT_low_pc(WideTimer1A_Handler)
	.dwattr $C$DW$84, DW_AT_high_pc(0x00)
	.dwattr $C$DW$84, DW_AT_TI_symbol_name("WideTimer1A_Handler")
	.dwattr $C$DW$84, DW_AT_external
	.dwattr $C$DW$84, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$84, DW_AT_TI_begin_line(0x203)
	.dwattr $C$DW$84, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$84, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$84, DW_AT_decl_line(0x203)
	.dwattr $C$DW$84, DW_AT_decl_column(0x06)
	.dwattr $C$DW$84, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 515,column 31,is_stmt,address WideTimer1A_Handler,isa 1

	.dwfde $C$DW$CIE, WideTimer1A_Handler

