glennlopez/EmbeddedSystems.Playground/Texas Instruments/TM4C123G/Projects/GPIO_4C123/Debug/tm4c123gh6pm_startup_ccs.asm
;*****************************************************************************
;* FUNCTION NAME: WideTimer1A_Handler                                        *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
WideTimer1A_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 515,column 39,is_stmt,isa 1
;----------------------------------------------------------------------
; 515 | void WideTimer1A_Handler(void){ while(1){}}        // Wide Timer 1 subt
;     | imer A                                                                 
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L80||
;*
;*   Loop source line                : 515
;*   Loop closing brace source line  : 515
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L80||:    
        B         ||$C$L80||            ; [DPU_3_PIPE] |515| 
        ; BRANCH OCCURS {||$C$L80||}     ; [] |515| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$84, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$84, DW_AT_TI_end_line(0x203)
	.dwattr $C$DW$84, DW_AT_TI_end_column(0x2b)
	.dwendentry
	.dwendtag $C$DW$84

	.sect	".text"
	.clink
	.thumbfunc WideTimer1B_Handler
	.thumb
	.weak	WideTimer1B_Handler

$C$DW$85	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$85, DW_AT_name("WideTimer1B_Handler")
	.dwattr $C$DW$85, DW_AT_low_pc(WideTimer1B_Handler)
	.dwattr $C$DW$85, DW_AT_high_pc(0x00)
	.dwattr $C$DW$85, DW_AT_TI_symbol_name("WideTimer1B_Handler")
	.dwattr $C$DW$85, DW_AT_external
	.dwattr $C$DW$85, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$85, DW_AT_TI_begin_line(0x204)
	.dwattr $C$DW$85, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$85, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$85, DW_AT_decl_line(0x204)
	.dwattr $C$DW$85, DW_AT_decl_column(0x06)
	.dwattr $C$DW$85, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 516,column 31,is_stmt,address WideTimer1B_Handler,isa 1

	.dwfde $C$DW$CIE, WideTimer1B_Handler

;*****************************************************************************
;* FUNCTION NAME: WideTimer1B_Handler                                        *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
WideTimer1B_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 516,column 39,is_stmt,isa 1
;----------------------------------------------------------------------
; 516 | void WideTimer1B_Handler(void){ while(1){}}        // Wide Timer 1 subt
;     | imer B                                                                 
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L81||
;*
;*   Loop source line                : 516
;*   Loop closing brace source line  : 516
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L81||:    
        B         ||$C$L81||            ; [DPU_3_PIPE] |516| 
        ; BRANCH OCCURS {||$C$L81||}     ; [] |516| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$85, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$85, DW_AT_TI_end_line(0x204)
	.dwattr $C$DW$85, DW_AT_TI_end_column(0x2b)
	.dwendentry
	.dwendtag $C$DW$85

	.sect	".text"
	.clink
	.thumbfunc WideTimer2A_Handler
	.thumb
	.weak	WideTimer2A_Handler

$C$DW$86	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$86, DW_AT_name("WideTimer2A_Handler")
	.dwattr $C$DW$86, DW_AT_low_pc(WideTimer2A_Handler)
	.dwattr $C$DW$86, DW_AT_high_pc(0x00)
	.dwattr $C$DW$86, DW_AT_TI_symbol_name("WideTimer2A_Handler")
	.dwattr $C$DW$86, DW_AT_external
	.dwattr $C$DW$86, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$86, DW_AT_TI_begin_line(0x205)
	.dwattr $C$DW$86, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$86, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$86, DW_AT_decl_line(0x205)
	.dwattr $C$DW$86, DW_AT_decl_column(0x06)
	.dwattr $C$DW$86, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 517,column 31,is_stmt,address WideTimer2A_Handler,isa 1

	.dwfde $C$DW$CIE, WideTimer2A_Handler

;*****************************************************************************
;* FUNCTION NAME: WideTimer2A_Handler                                        *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
WideTimer2A_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 517,column 39,is_stmt,isa 1
;----------------------------------------------------------------------
; 517 | void WideTimer2A_Handler(void){ while(1){}}        // Wide Timer 2 subt
;     | imer A                                                                 
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L82||
;*
;*   Loop source line                : 517
;*   Loop closing brace source line  : 517
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L82||:    
        B         ||$C$L82||            ; [DPU_3_PIPE] |517| 
        ; BRANCH OCCURS {||$C$L82||}     ; [] |517| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$86, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$86, DW_AT_TI_end_line(0x205)
	.dwattr $C$DW$86, DW_AT_TI_end_column(0x2b)
	.dwendentry
	.dwendtag $C$DW$86

	.sect	".text"
	.clink
	.thumbfunc WideTimer2B_Handler
	.thumb
	.weak	WideTimer2B_Handler

