glennlopez/EmbeddedSystems.Playground/Texas Instruments/TM4C123G/Projects/GPIO_4C123/Debug/tm4c123gh6pm_startup_ccs.asm
;*****************************************************************************
;* FUNCTION NAME: Quadrature2_Handler                                        *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
Quadrature2_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 532,column 39,is_stmt,isa 1
;----------------------------------------------------------------------
; 532 | void Quadrature2_Handler(void){ while(1){}}        // Quadrature Encode
;     | r 2                                                                    
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L97||
;*
;*   Loop source line                : 532
;*   Loop closing brace source line  : 532
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L97||:    
        B         ||$C$L97||            ; [DPU_3_PIPE] |532| 
        ; BRANCH OCCURS {||$C$L97||}     ; [] |532| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$101, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$101, DW_AT_TI_end_line(0x214)
	.dwattr $C$DW$101, DW_AT_TI_end_column(0x2b)
	.dwendentry
	.dwendtag $C$DW$101

	.sect	".text"
	.clink
	.thumbfunc Fan0_Handler
	.thumb
	.weak	Fan0_Handler

$C$DW$102	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$102, DW_AT_name("Fan0_Handler")
	.dwattr $C$DW$102, DW_AT_low_pc(Fan0_Handler)
	.dwattr $C$DW$102, DW_AT_high_pc(0x00)
	.dwattr $C$DW$102, DW_AT_TI_symbol_name("Fan0_Handler")
	.dwattr $C$DW$102, DW_AT_external
	.dwattr $C$DW$102, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$102, DW_AT_TI_begin_line(0x215)
	.dwattr $C$DW$102, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$102, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$102, DW_AT_decl_line(0x215)
	.dwattr $C$DW$102, DW_AT_decl_column(0x06)
	.dwattr $C$DW$102, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 533,column 24,is_stmt,address Fan0_Handler,isa 1

	.dwfde $C$DW$CIE, Fan0_Handler

;*****************************************************************************
;* FUNCTION NAME: Fan0_Handler                                               *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
Fan0_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 533,column 32,is_stmt,isa 1
;----------------------------------------------------------------------
; 533 | void Fan0_Handler(void){ while(1){}}               // Fan 0            
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L98||
;*
;*   Loop source line                : 533
;*   Loop closing brace source line  : 533
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L98||:    
        B         ||$C$L98||            ; [DPU_3_PIPE] |533| 
        ; BRANCH OCCURS {||$C$L98||}     ; [] |533| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$102, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$102, DW_AT_TI_end_line(0x215)
	.dwattr $C$DW$102, DW_AT_TI_end_column(0x24)
	.dwendentry
	.dwendtag $C$DW$102

	.sect	".text"
	.clink
	.thumbfunc GPIOPortP_Handler
	.thumb
	.weak	GPIOPortP_Handler

$C$DW$103	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$103, DW_AT_name("GPIOPortP_Handler")
	.dwattr $C$DW$103, DW_AT_low_pc(GPIOPortP_Handler)
	.dwattr $C$DW$103, DW_AT_high_pc(0x00)
	.dwattr $C$DW$103, DW_AT_TI_symbol_name("GPIOPortP_Handler")
	.dwattr $C$DW$103, DW_AT_external
	.dwattr $C$DW$103, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$103, DW_AT_TI_begin_line(0x216)
	.dwattr $C$DW$103, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$103, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$103, DW_AT_decl_line(0x216)
	.dwattr $C$DW$103, DW_AT_decl_column(0x06)
	.dwattr $C$DW$103, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 534,column 29,is_stmt,address GPIOPortP_Handler,isa 1

	.dwfde $C$DW$CIE, GPIOPortP_Handler

;*****************************************************************************
;* FUNCTION NAME: GPIOPortP_Handler                                          *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
GPIOPortP_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 534,column 37,is_stmt,isa 1
;----------------------------------------------------------------------
; 534 | void GPIOPortP_Handler(void){ while(1){}}          // GPIO Port P (Summ
;     | ary or P0)                                                             
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L99||
;*
;*   Loop source line                : 534
;*   Loop closing brace source line  : 534
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L99||:    
        B         ||$C$L99||            ; [DPU_3_PIPE] |534| 
        ; BRANCH OCCURS {||$C$L99||}     ; [] |534| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$103, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$103, DW_AT_TI_end_line(0x216)
	.dwattr $C$DW$103, DW_AT_TI_end_column(0x29)
	.dwendentry
	.dwendtag $C$DW$103

	.sect	".text"
	.clink
	.thumbfunc GPIOPortP1_Handler
	.thumb
	.weak	GPIOPortP1_Handler

$C$DW$104	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$104, DW_AT_name("GPIOPortP1_Handler")
	.dwattr $C$DW$104, DW_AT_low_pc(GPIOPortP1_Handler)
	.dwattr $C$DW$104, DW_AT_high_pc(0x00)
	.dwattr $C$DW$104, DW_AT_TI_symbol_name("GPIOPortP1_Handler")
	.dwattr $C$DW$104, DW_AT_external
	.dwattr $C$DW$104, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$104, DW_AT_TI_begin_line(0x217)
	.dwattr $C$DW$104, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$104, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$104, DW_AT_decl_line(0x217)
	.dwattr $C$DW$104, DW_AT_decl_column(0x06)
	.dwattr $C$DW$104, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 535,column 30,is_stmt,address GPIOPortP1_Handler,isa 1

	.dwfde $C$DW$CIE, GPIOPortP1_Handler

