glennlopez/EmbeddedSystems.Playground/Texas Instruments/TM4C123G/Projects/GPIO_4C123/Debug/tm4c123gh6pm_startup_ccs.asm
;*****************************************************************************
;* FUNCTION NAME: PWM1Fault_Handler                                          *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
PWM1Fault_Handler:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 556,column 37,is_stmt,isa 1
;----------------------------------------------------------------------
; 556 | void PWM1Fault_Handler(void){ while(1){}}          // PWM 1 Fault      
;----------------------------------------------------------------------
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP ||$C$L121||
;*
;*   Loop source line                : 556
;*   Loop closing brace source line  : 556
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
||$C$L121||:    
        B         ||$C$L121||           ; [DPU_3_PIPE] |556| 
        ; BRANCH OCCURS {||$C$L121||}    ; [] |556| 
;* --------------------------------------------------------------------------*
	.dwattr $C$DW$125, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$125, DW_AT_TI_end_line(0x22c)
	.dwattr $C$DW$125, DW_AT_TI_end_column(0x29)
	.dwendentry
	.dwendtag $C$DW$125

	.sect	".text"
	.clink
	.thumbfunc DisableInterrupts
	.thumb
	.global	DisableInterrupts

$C$DW$126	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$126, DW_AT_name("DisableInterrupts")
	.dwattr $C$DW$126, DW_AT_low_pc(DisableInterrupts)
	.dwattr $C$DW$126, DW_AT_high_pc(0x00)
	.dwattr $C$DW$126, DW_AT_TI_symbol_name("DisableInterrupts")
	.dwattr $C$DW$126, DW_AT_external
	.dwattr $C$DW$126, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$126, DW_AT_TI_begin_line(0x232)
	.dwattr $C$DW$126, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$126, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$126, DW_AT_decl_line(0x232)
	.dwattr $C$DW$126, DW_AT_decl_column(0x06)
	.dwattr $C$DW$126, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 562,column 29,is_stmt,address DisableInterrupts,isa 1

	.dwfde $C$DW$CIE, DisableInterrupts
;----------------------------------------------------------------------
; 562 | void DisableInterrupts(void){                                          
;----------------------------------------------------------------------

;*****************************************************************************
;* FUNCTION NAME: DisableInterrupts                                          *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
DisableInterrupts:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 563,column 2,is_stmt,isa 1
;----------------------------------------------------------------------
; 563 | __asm ("    CPSID  I\n");                                              
;----------------------------------------------------------------------
    CPSID  I
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 564,column 1,is_stmt,isa 1
$C$DW$127	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$127, DW_AT_low_pc(0x00)
	.dwattr $C$DW$127, DW_AT_TI_return

        BX        LR                    ; [DPU_3_PIPE] 
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$126, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$126, DW_AT_TI_end_line(0x234)
	.dwattr $C$DW$126, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$126

	.sect	".text"
	.clink
	.thumbfunc EnableInterrupts
	.thumb
	.global	EnableInterrupts

$C$DW$128	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$128, DW_AT_name("EnableInterrupts")
	.dwattr $C$DW$128, DW_AT_low_pc(EnableInterrupts)
	.dwattr $C$DW$128, DW_AT_high_pc(0x00)
	.dwattr $C$DW$128, DW_AT_TI_symbol_name("EnableInterrupts")
	.dwattr $C$DW$128, DW_AT_external
	.dwattr $C$DW$128, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$128, DW_AT_TI_begin_line(0x23a)
	.dwattr $C$DW$128, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$128, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$128, DW_AT_decl_line(0x23a)
	.dwattr $C$DW$128, DW_AT_decl_column(0x06)
	.dwattr $C$DW$128, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 570,column 28,is_stmt,address EnableInterrupts,isa 1

	.dwfde $C$DW$CIE, EnableInterrupts
;----------------------------------------------------------------------
; 570 | void EnableInterrupts(void){                                           
;----------------------------------------------------------------------

;*****************************************************************************
;* FUNCTION NAME: EnableInterrupts                                           *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
EnableInterrupts:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 571,column 2,is_stmt,isa 1
;----------------------------------------------------------------------
; 571 | __asm  ("    CPSIE  I\n");                                             
;----------------------------------------------------------------------
    CPSIE  I
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 572,column 1,is_stmt,isa 1
$C$DW$129	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$129, DW_AT_low_pc(0x00)
	.dwattr $C$DW$129, DW_AT_TI_return

        BX        LR                    ; [DPU_3_PIPE] 
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$128, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$128, DW_AT_TI_end_line(0x23c)
	.dwattr $C$DW$128, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$128

	.sect	".text"
	.clink
	.thumbfunc StartCritical
	.thumb
	.global	StartCritical

