glennlopez/EmbeddedSystems.Playground/Texas Instruments/TM4C123G/Projects/GPIO_4C123/Debug/tm4c123gh6pm_startup_ccs.asm
$C$DW$130	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$130, DW_AT_name("StartCritical")
	.dwattr $C$DW$130, DW_AT_low_pc(StartCritical)
	.dwattr $C$DW$130, DW_AT_high_pc(0x00)
	.dwattr $C$DW$130, DW_AT_TI_symbol_name("StartCritical")
	.dwattr $C$DW$130, DW_AT_external
	.dwattr $C$DW$130, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$130, DW_AT_TI_begin_line(0x241)
	.dwattr $C$DW$130, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$130, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$130, DW_AT_decl_line(0x241)
	.dwattr $C$DW$130, DW_AT_decl_column(0x06)
	.dwattr $C$DW$130, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 577,column 25,is_stmt,address StartCritical,isa 1

	.dwfde $C$DW$CIE, StartCritical
;----------------------------------------------------------------------
; 577 | void StartCritical(void){                                              
;----------------------------------------------------------------------

;*****************************************************************************
;* FUNCTION NAME: StartCritical                                              *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
StartCritical:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 578,column 2,is_stmt,isa 1
;----------------------------------------------------------------------
; 578 | __asm  ("    MRS    R0, PRIMASK  ; save old status \n"                 
; 579 |         "    CPSID  I            ; mask all (except faults)\n");       
;----------------------------------------------------------------------
    MRS    R0, PRIMASK  ; save old status 
    CPSID  I         	  ; mask all (except faults)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 580,column 1,is_stmt,isa 1
$C$DW$131	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$131, DW_AT_low_pc(0x00)
	.dwattr $C$DW$131, DW_AT_TI_return

        BX        LR                    ; [DPU_3_PIPE] 
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$130, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$130, DW_AT_TI_end_line(0x244)
	.dwattr $C$DW$130, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$130

	.sect	".text"
	.clink
	.thumbfunc EndCritical
	.thumb
	.global	EndCritical

$C$DW$132	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$132, DW_AT_name("EndCritical")
	.dwattr $C$DW$132, DW_AT_low_pc(EndCritical)
	.dwattr $C$DW$132, DW_AT_high_pc(0x00)
	.dwattr $C$DW$132, DW_AT_TI_symbol_name("EndCritical")
	.dwattr $C$DW$132, DW_AT_external
	.dwattr $C$DW$132, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$132, DW_AT_TI_begin_line(0x24a)
	.dwattr $C$DW$132, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$132, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$132, DW_AT_decl_line(0x24a)
	.dwattr $C$DW$132, DW_AT_decl_column(0x06)
	.dwattr $C$DW$132, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 586,column 23,is_stmt,address EndCritical,isa 1

	.dwfde $C$DW$CIE, EndCritical
;----------------------------------------------------------------------
; 586 | void EndCritical(void){                                                
;----------------------------------------------------------------------

;*****************************************************************************
;* FUNCTION NAME: EndCritical                                                *
;*                                                                           *
;*   Regs Modified     :                                                     *
;*   Regs Used         : LR                                                  *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
EndCritical:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 587,column 2,is_stmt,isa 1
;----------------------------------------------------------------------
; 587 | __asm  ("    MSR    PRIMASK, R0\n");                                   
;----------------------------------------------------------------------
    MSR    PRIMASK, R0
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 588,column 1,is_stmt,isa 1
$C$DW$133	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$133, DW_AT_low_pc(0x00)
	.dwattr $C$DW$133, DW_AT_TI_return

        BX        LR                    ; [DPU_3_PIPE] 
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$132, DW_AT_TI_end_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$132, DW_AT_TI_end_line(0x24c)
	.dwattr $C$DW$132, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$132

	.sect	".text"
	.clink
	.thumbfunc WaitForInterrupt
	.thumb
	.global	WaitForInterrupt

$C$DW$134	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$134, DW_AT_name("WaitForInterrupt")
	.dwattr $C$DW$134, DW_AT_low_pc(WaitForInterrupt)
	.dwattr $C$DW$134, DW_AT_high_pc(0x00)
	.dwattr $C$DW$134, DW_AT_TI_symbol_name("WaitForInterrupt")
	.dwattr $C$DW$134, DW_AT_external
	.dwattr $C$DW$134, DW_AT_TI_begin_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$134, DW_AT_TI_begin_line(0x252)
	.dwattr $C$DW$134, DW_AT_TI_begin_column(0x06)
	.dwattr $C$DW$134, DW_AT_decl_file("../tm4c123gh6pm_startup_ccs.c")
	.dwattr $C$DW$134, DW_AT_decl_line(0x252)
	.dwattr $C$DW$134, DW_AT_decl_column(0x06)
	.dwattr $C$DW$134, DW_AT_TI_max_frame_size(0x00)
	.dwpsn	file "../tm4c123gh6pm_startup_ccs.c",line 594,column 28,is_stmt,address WaitForInterrupt,isa 1

	.dwfde $C$DW$CIE, WaitForInterrupt
;----------------------------------------------------------------------
; 594 | void WaitForInterrupt(void){                                           
;----------------------------------------------------------------------

